app/Http/Controllers/Admin/ProductController.php

select * from `products` limit 5 offset 0
select count(*) as aggregate from `products`
---
    public function index()
    {
        $restaurant = Auth::user()->restaurant;

        if ($restaurant) {
            $products = $restaurant->products()->paginate(5);

select * from `products` where `slug` = 'pollo-al-curry-cremoso' limit 1
---
    public function edit($slug)
    {
        $product = Product::where('slug', $slug)->firstOrFail();

select * from `products` where `slug` = 'pollo-al-curry-cremoso' limit 1
---
    public function update(Request $request, $slug)
    {
        $product = Product::where('slug', $slug)->firstOrFail();